<?php

use Illuminate\Database\Seeder;

class BlogSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        \App\Blog::create([
            'blog_title' => "টাঙ্গুয়ার হাওরে প্রথম যাত্রা",
            'blog_details' => "সময়টা অন্য রকম। একদিকে করোনাভাইরাস সংক্রমণের কারণে গৃহবন্দী জীবন। আর এরই মধ্যে শুরু হয়ে গেছে পবিত্র রমজান মাস। সঙ্গে আছে গ্রীষ্মের উত্তাপ, কখনো আবার হঠাৎ কালো হয়ে আসা আকাশ—বৃষ্টি আর কালবৈশাখী। মনের আকাশেও মেঘ জমে সংকটকালীন চিন্তার চাপে। নানাবিধ পরিবর্তন জীবনধারায়। গৃহবন্দী সময়ে জীবনযাত্রার প্রয়োজনীয় সব উপকরণ হাতের কাছে সব সময় না-ও থাকতে পারে। রূপচর্চাতে তাই বেছে নিতে পারেন সহজলভ্য উপকরণ। ঘরে বসে এই ত্বকের যত্ন নিলে ত্বক তো বটেই, মনটাও ভালো থাকবে। করোনাকালে যা জরুরি।",
            'author_id' => 1,
            'featured_image' => "Bashbaria.jpg",
            'category_id' => json_encode(['1',rand(1, 18)]),
        ]);
        \App\Blog::create([
            'blog_title' => "সাইক্লিং: মালয়েশিয়া থেকে ঢাকা",
            'blog_details' => "সময়টা অন্য রকম। একদিকে করোনাভাইরাস সংক্রমণের কারণে গৃহবন্দী জীবন। আর এরই মধ্যে শুরু হয়ে গেছে পবিত্র রমজান মাস। সঙ্গে আছে গ্রীষ্মের উত্তাপ, কখনো আবার হঠাৎ কালো হয়ে আসা আকাশ—বৃষ্টি আর কালবৈশাখী। মনের আকাশেও মেঘ জমে সংকটকালীন চিন্তার চাপে। নানাবিধ পরিবর্তন জীবনধারায়। গৃহবন্দী সময়ে জীবনযাত্রার প্রয়োজনীয় সব উপকরণ হাতের কাছে সব সময় না-ও থাকতে পারে। রূপচর্চাতে তাই বেছে নিতে পারেন সহজলভ্য উপকরণ। ঘরে বসে এই ত্বকের যত্ন নিলে ত্বক তো বটেই, মনটাও ভালো থাকবে। করোনাকালে যা জরুরি।",
            'author_id' => 1,
            'featured_image' => "Jaflong.jpg",
            'category_id' => json_encode(['1',rand(1, 18)]),
        ]);
        \App\Blog::create([
            'blog_title' => "ফরাসি অভিযাত্রী",
            'blog_details' => "সময়টা অন্য রকম। একদিকে করোনাভাইরাস সংক্রমণের কারণে গৃহবন্দী জীবন। আর এরই মধ্যে শুরু হয়ে গেছে পবিত্র রমজান মাস। সঙ্গে আছে গ্রীষ্মের উত্তাপ, কখনো আবার হঠাৎ কালো হয়ে আসা আকাশ—বৃষ্টি আর কালবৈশাখী। মনের আকাশেও মেঘ জমে সংকটকালীন চিন্তার চাপে। নানাবিধ পরিবর্তন জীবনধারায়। গৃহবন্দী সময়ে জীবনযাত্রার প্রয়োজনীয় সব উপকরণ হাতের কাছে সব সময় না-ও থাকতে পারে। রূপচর্চাতে তাই বেছে নিতে পারেন সহজলভ্য উপকরণ। ঘরে বসে এই ত্বকের যত্ন নিলে ত্বক তো বটেই, মনটাও ভালো থাকবে। করোনাকালে যা জরুরি।",
            'author_id' => 1,
            'featured_image' => "Sajek-valley.jpg",
            'category_id' => json_encode(['1',rand(1, 18)]),
        ]);
        \App\Blog::create([
            'blog_title' => "Camping in Winter",
            'blog_details' => "সময়টা অন্য রকম। একদিকে করোনাভাইরাস সংক্রমণের কারণে গৃহবন্দী জীবন। আর এরই মধ্যে শুরু হয়ে গেছে পবিত্র রমজান মাস। সঙ্গে আছে গ্রীষ্মের উত্তাপ, কখনো আবার হঠাৎ কালো হয়ে আসা আকাশ—বৃষ্টি আর কালবৈশাখী। মনের আকাশেও মেঘ জমে সংকটকালীন চিন্তার চাপে। নানাবিধ পরিবর্তন জীবনধারায়। গৃহবন্দী সময়ে জীবনযাত্রার প্রয়োজনীয় সব উপকরণ হাতের কাছে সব সময় না-ও থাকতে পারে। রূপচর্চাতে তাই বেছে নিতে পারেন সহজলভ্য উপকরণ। ঘরে বসে এই ত্বকের যত্ন নিলে ত্বক তো বটেই, মনটাও ভালো থাকবে। করোনাকালে যা জরুরি।",
            'author_id' => 1,
            'featured_image' => "Sapla-Bil.jpg",
            'category_id' => json_encode(['1',rand(1, 18)]),
        ]);
    }
}
